#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <string.h>
void jie()
{	//
	int a=0,i,j=0;
	while(a<=7)
	{	
          system("color 9f");
		i=(unsigned)time(NULL);
		if(i%2==0 && i>j)
		{	
			system("cls");
         
			printf("\n\n\n\n\n\n\n");
            printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
            printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
            printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
            printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
            printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
            printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
            printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
            printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
            printf("!!                °Ó°Ó              !!\n");
			printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
            printf("i=%d\n",i);
				j=i;
				a++;
		}
	    	else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô                °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó    (*^__^*)  °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
				else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                 printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó   !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                 printf("!!       °Ó°Ó              °Ó°Ó    !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                 printf("!!          °Ó°Ó        °Ó°Ó       !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
	else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô            °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó     Œ˚Œ˚      °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô            °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!         °Ó°Ó           °Ó°Ó     !!\n");
                 printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                 printf("!!            °Ô°Ô   °Ô°Ô          !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó                  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
				else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô               °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
	else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                   printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó       !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                   printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                   printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                   printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			      printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                  printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                  printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                  printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                  printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                  printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô           °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!        °Ó°Ó            °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!           °Ó°Ó       °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô          °Ô        °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó   ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô  (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
				else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó   ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô     (*^__^*)     °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
	else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó      ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô     (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô   Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!             °Ô°Ô    °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó    ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô   (*^__^*)    °Ô°Ô    !!\n");
                printf("!!        °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!       °Ô°Ô    Œ˚Œ˚  °Ô°Ô       !!\n");
                printf("!!         °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó    ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!         °Ô°Ô   Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!             °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!        °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!          °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!              °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                  °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!         °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!           °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!             °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                 °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
				else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!         °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!            °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!             °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                 °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
	else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!        °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!         °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!            °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!             °Ô°Ô    °Ô°Ô           !!\n");
                printf("!!                 °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!      °Ô°Ô       °Ô        °Ô°Ô     !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!       °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!         °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!             °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!         °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!            °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó   ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô  (*^__^*)    °Ô°Ô    !!\n");
                printf("!!      °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!       °Ô°Ô   Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!         °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!           °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!               °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}

else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!      °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!      °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!        °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!         °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!           °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!             °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			
				else if(i%2!=0 && i>j)
			{
				system("cls");
				printf("\n\n\n\n\n\n\n");	
		        printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");
			    printf("!!       °Ó°Ó °Ó°Ó  °Ó°Ó °Ó°Ó       !!\n");
                printf("!!     °Ô°Ô       °Ô        °Ô°Ô    !!\n");
                printf("!!     °Ó°Ó     ª∂”≠‘Ÿ¿¥£°  °Ó°Ó    !!\n");
                printf("!!      °Ô°Ô    (*^__^*)    °Ô°Ô    !!\n");
                printf("!!       °Ó°Ó              °Ó°Ó     !!\n");
                printf("!!        °Ô°Ô    Œ˚Œ˚   °Ô°Ô       !!\n");
                printf("!!          °Ó°Ó        °Ó°Ó        !!\n");
                printf("!!            °Ô°Ô   °Ô°Ô           !!\n");
                printf("!!                °Ó°Ó              !!\n");
			    printf("!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n");  
                printf("i=%d\n",i);
				j=i;
				a++;
			}
			







































































































			
	

 


































































































}
}

			